ord('A')#获取字符的整数表示
ord('中')
chr(66)#把编码转换为对应的字符
chr(25991)
print(ord('A'))
print(ord('中'))
print(chr(25991))
print(chr(66))
print('\u4e2d\u6587')
print('---------------------------------------------------')
#str==>bytes  字符变字节
#Python对bytes类型的数据用带'b前缀的单引号或双引号'表示
x = b'ABC'
y = b'\xe4\xb8\xad\xe6\x96\x87'
print(x)
print('---------------------------------------------------')
#格式化
#%d	整数
#%f	浮点数
#%s	字符串
#%x	十六进制整数
print('我是%s'%'胡文雨')
print('我的身高是%fcm'%181.5)
print('我的身高是%dcm'%181.5)
print('%2d-%02d' % (3, 1))
hour = 3
minute = 5
print('%02d:%02d' % (hour, minute))  # 03:05
print('%.2f' % 3.1415926)
#%2d  空格补位右对齐
#%02d 零来补位更整齐
#%.2f 小数位数随意配
print('---------------------------------------------------')
#小明的成绩从去年的72分提升到了今年的85分，请计算小明成绩提升的百分点，并用字符串格式化显示出'xx.x%'，只保留小数点后1位
s1=72
s2=85
r=float(s2-s1)/s1*100
print('小明的成绩是%.1f%%'%r)#如果你想输出一个真正的百分号 %，需要写两个百分号 %%。
